# **Pandas**

<hr>

In [1]:
import numpy as np
import pandas as pd

## **A. Missing Data**

## Create DataFrame with NaN Values

In [20]:
df = pd.DataFrame({
    'Jakarta' : [100, 200, np.nan],
    'Bandung' : [500, np.nan, np.nan],
    'Bekasi' : [100, 200, 300]
})

df

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      NaN     200
2      NaN      NaN     300

## Dropna() method : menghapus data kosong

In [22]:
# menghapus seluruh baris yang memiliki data NaN
df.dropna()

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100

In [25]:
# menghapus kolom yang memiliki data NaN
df.dropna(axis = 1)

   Bekasi
0     100
1     200
2     300

In [35]:
# thresh: jumlah data minimal di setiap baris
df.dropna(thresh = 2)

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      NaN     200

In [37]:
# thresh: jumlah data minimal di setiap kolom (axis = 1)
df.dropna(axis=1, thresh = 3)

   Bekasi
0     100
1     200
2     300

## Fillna() method : mengisi data kosong

In [38]:
df.fillna(value='data terisi')

       Jakarta      Bandung  Bekasi
0          100          500     100
1          200  data terisi     200
2  data terisi  data terisi     300

In [39]:
df.fillna(value=100)

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0    100.0     200
2    100.0    100.0     300

In [41]:
# mengisi data NaN pada kolom 'Jakarta' dengan value: rata-rata value di kolom Jakarta
df['Jakarta'].fillna(value = df['Jakarta'].mean())

0    100.0
1    200.0
2    150.0
Name: Jakarta, dtype: float64

In [44]:
df['Bandung'].fillna(value = df['Bekasi'].mean())

0    500.0
1    200.0
2    200.0
Name: Bandung, dtype: float64

In [50]:
df.iloc[1:2, 1:2].fillna(value = df['Bekasi'].mean())

   Bandung
1    200.0

## **B. Groupby**

In [52]:
# Create dataframe
data = {
    'Perusahaan' : ['Ayam', 'Ayam', 'Mie', 'Mie', 'Pizza', 'Pizza'],
    'Karyawan' : ['Andi', 'Budi', 'Caca', 'Deni', 'Edi', 'Ferdi'],
    'Penjualan': [300, 200, 100, 800, 950, 150]
}

df1 = pd.DataFrame(data)
df1

  Perusahaan Karyawan  Penjualan
0       Ayam     Andi        300
1       Ayam     Budi        200
2        Mie     Caca        100
3        Mie     Deni        800
4      Pizza      Edi        950
5      Pizza    Ferdi        150

In [56]:
# menampilkan 2 baris awal dari dataset
df1.head(2)

  Perusahaan Karyawan  Penjualan
0       Ayam     Andi        300
1       Ayam     Budi        200

In [58]:
# menampilkan 2 baris akhir dari dataset
df1.tail(2)

  Perusahaan Karyawan  Penjualan
4      Pizza      Edi        950
5      Pizza    Ferdi        150

## Groupby() method = pengelompokan data

In [65]:
# data dikelompokan berdasarkan kolom perusahaan
by_perusahaan = df1.groupby('Perusahaan')

In [66]:
# data pengelompokan dihitung berdasarkan rata-rata (mean)
by_perusahaan.mean()

            Penjualan
Perusahaan
Ayam              250
Mie               450
Pizza             550

In [67]:
# data pengelompokan dihitung berdasarkan nilai tengah (median)
by_perusahaan.median()

            Penjualan
Perusahaan
Ayam              250
Mie               450
Pizza             550

In [71]:
df1.groupby('Perusahaan').mean()

            Penjualan
Perusahaan
Ayam              250
Mie               450
Pizza             550

In [72]:
# groupby dengan output standar deviasi (digunakan untuk mengetahui variasi data)
by_perusahaan.std()

             Penjualan
Perusahaan
Ayam         70.710678
Mie         494.974747
Pizza       565.685425

In [73]:
by_perusahaan.min()

           Karyawan  Penjualan
Perusahaan
Ayam           Andi        200
Mie            Caca        100
Pizza           Edi        150

In [74]:
by_perusahaan.max()

           Karyawan  Penjualan
Perusahaan
Ayam           Budi        300
Mie            Deni        800
Pizza         Ferdi        950

In [75]:
by_perusahaan.count()

            Karyawan  Penjualan
Perusahaan
Ayam               2          2
Mie                2          2
Pizza              2          2

In [79]:
by_perusahaan.describe()

           Penjualan
               count   mean         std    min    25%    50%    75%    max
Perusahaan
Ayam             2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
Mie              2.0  450.0  494.974747  100.0  275.0  450.0  625.0  800.0
Pizza            2.0  550.0  565.685425  150.0  350.0  550.0  750.0  950.0

In [80]:
by_perusahaan.describe().transpose()

Perusahaan             Ayam         Mie       Pizza
Penjualan count    2.000000    2.000000    2.000000
          mean   250.000000  450.000000  550.000000
          std     70.710678  494.974747  565.685425
          min    200.000000  100.000000  150.000000
          25%    225.000000  275.000000  350.000000
          50%    250.000000  450.000000  550.000000
          75%    275.000000  625.000000  750.000000
          max    300.000000  800.000000  950.000000

In [82]:
by_perusahaan.describe().transpose()[['Ayam', 'Pizza']]

Perusahaan             Ayam       Pizza
Penjualan count    2.000000    2.000000
          mean   250.000000  550.000000
          std     70.710678  565.685425
          min    200.000000  150.000000
          25%    225.000000  350.000000
          50%    250.000000  550.000000
          75%    275.000000  750.000000
          max    300.000000  950.000000

In [84]:
by_perusahaan.describe().transpose()[['Ayam', 'Pizza']].loc['Penjualan'].loc['mean']

Perusahaan
Ayam     250.0
Pizza    550.0
Name: mean, dtype: float64

## **C. Merge, Join, & Concatenating**

In [101]:
df_A = pd.DataFrame({'Jakarta': [1, 2, 3, 4],
                    'Bandung' : [5, 6, 7, 8],
                     'Bekasi' : [1, 2, 3, 4],
                     'BSD' : [5, 6, 7, 8]},
                    index = [0, 1, 2, 3])

df_B = pd.DataFrame({'Jakarta': [1, 2, 3, 4],
                    'Bandung' : [5, 6, 7, 8],
                     'Bekasi' : [1, 2, 3, 4],
                     'BSD' : [5, 6, 7, 8]},
                    index = [4, 5, 6, 7])

df_C = pd.DataFrame({'Jakarta': [1, 2, 3, 4],
                    'Bandung' : [5, 6, 7, 8],
                     'Bekasi' : [1, 2, 3, 4],
                     'BSD' : [5, 6, 7, 8]},
                    index = [8, 9, 10, 11])

## Concatenation

In [93]:
pd.concat([df_B, df_A, df_C])

    Jakarta  Bandung  Bekasi  BSD
4         1        5       1    5
5         2        6       2    6
6         3        7       3    7
7         4        8       4    8
0         1        5       1    5
1         2        6       2    6
2         3        7       3    7
3         4        8       4    8
8         1        5       1    5
9         2        6       2    6
10        3        7       3    7
11        4        8       4    8

In [102]:
#df_A digabung dengan df_B dan df_C secara kolom/horizontal/nambah kolom (axis = 1)
pd.concat([df_A, df_B, df_C], axis=1)

,Jakarta,Bandung,Bekasi,BSD,Jakarta,Bandung,Bekasi,BSD,Jakarta,Bandung,Bekasi,BSD
0,1.0,5.0,1.0,5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,6.0,2.0,6.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,7.0,3.0,7.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,8.0,4.0,8.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,1.0,5.0,1.0,5.0,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,2.0,6.0,2.0,6.0,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,3.0,7.0,3.0,7.0,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,4.0,8.0,4.0,8.0,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,5.0,1.0,5.0
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.0,6.0,2.0,6.0
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.0,7.0,3.0,7.0
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0,8.0,4.0,8.0

## Merging

**Type of merge to be performed**

-        left: use only keys from left frame, similar to a SQL left outer join; preserve key order.

-        right: use only keys from right frame, similar to a SQL right outer join; preserve key order.

-        outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.

-        inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.

In [105]:
# create dataframe
kiri = pd.DataFrame({
    'kunci' : ['A', 'B', 'C', 'D'],
    'Jakarta': [1, 2, 3, 4],
    'BSD': [5, 6, 7, 8]
})

kanan = pd.DataFrame({
    'kunci' : ['A', 'B', 'C', 'D'],
    'Bekasi': [1, 2, 3, 4],
    'Bandung': [5, 6, 7, 8]
})

In [107]:
pd.merge(kiri, kanan, how = 'inner', on = 'kunci')

  kunci  Jakarta  BSD  Bekasi  Bandung
0     A        1    5       1        5
1     B        2    6       2        6
2     C        3    7       3        7
3     D        4    8       4        8

## Join

In [126]:
Budi = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                   index = ['K0', 'K1', 'K2'])

Andi = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                     'D': ['D0', 'D2', 'D3']},
                   index = ['K0', 'K2', 'K3'])

In [128]:
Budi

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [129]:
Andi

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [132]:
# tabel right bergabung dengan left, dan mengikuti index-nya left
Budi.join(Andi)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [133]:
# tabel left bergabung dengan right, dan mengikuti index-nya right
Andi.join(Budi)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [131]:
Andi.join(Budi, how = 'left')

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

## **D. Operations**

In [135]:
# untuk mengetahui coloumns
df.columns

Index(['Jakarta', 'Bandung', 'Bekasi'], dtype='object')

In [136]:
# untuk mengetahui index
df.index

RangeIndex(start=0, stop=3, step=1)

In [138]:
# mengurutkan dataframe berdasarkan kolom tertentu
df.sort_values(by='Bekasi')

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      NaN     200
2      NaN      NaN     300

In [139]:
# untuk mengetahui apakah ada data kosong
df.isnull()

   Jakarta  Bandung  Bekasi
0    False    False   False
1    False     True   False
2     True     True   False

In [140]:
df.isna()

   Jakarta  Bandung  Bekasi
0    False    False   False
1    False     True   False
2     True     True   False

In [141]:
df.isna().sum()

Jakarta    1
Bandung    2
Bekasi     0
dtype: int64

## **E. Data Input & Output**

In [143]:
# untuk membaca file CSV
df_csv = pd.read_csv('Salaries.csv')
df_csv.head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

## It's time to PANDAS EXERCISE